from time import time

a = list(range(0, 10**6)) # вормируем список от 0 до 10^6 числа
simple_num = []
time1 = time() # время до выполнения

for i in range(2, len(a)):
    if a[i] != 0:
        n = i*2
        simple_num.append(a[i]) # добавляем простое число в массив простых чисел
        for j in range(n, len(a), i):
            a[j] = 0 

time2 = time() # замеряем время выполнения

print(a[0:50]) # вывод 49 чисел из первоначального массива
print(simple_num[0:50]) # вывод 49 чисел из массива простых чисел
print(f'time execution {time2 - time1}') # вывод времени выполнения 
'''
[0, 1, 2, 3, 0, 5, 0, 7, 0, 0, 0, 11, 0, 13, 0, 0, 0, 17, 0, 19, 0, 0, 0, 23, 0, 0, 0, 0, 0, 29, 0, 31, 0, 0, 0, 0, 0, 37, 0, 0, 0, 41, 0, 43, 0, 0, 0, 47, 0, 0]
[2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97, 101, 103, 107, 109, 113, 127, 131, 137, 139, 149, 151, 157, 163, 167, 173, 179, 181, 191, 193, 197, 199, 211, 223, 227, 229]
time execution 1.3390765190124512

'''
